MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/S6E2G26H0AGV20000/mcu.h
/*******************************************************************************
* Copyright (C) 2013-2016, Cypress Semiconductor Corporation or a              *
* subsidiary of Cypress Semiconductor Corporation.  All rights reserved.       *
*                                                                              *
* This software, including source code, documentation and related              *
* materials ("Software"), is owned by Cypress Semiconductor Corporation or     *
* one of its subsidiaries ("Cypress") and is protected by and subject to       *
* worldwide patent protection (United States and foreign), United States       *
* copyright laws and international treaty provisions. Therefore, you may use   *
* this Software only as provided in the license agreement accompanying the     *
* software package from which you obtained this Software ("EULA").             *
*                                                                              *
* If no EULA applies, Cypress hereby grants you a personal, non-exclusive,     *
* non-transferable license to copy, modify, and compile the                    *
* Software source code solely for use in connection with Cypress's             *
* integrated circuit products.  Any reproduction, modification, translation,   *
* compilation, or representation of this Software except as specified          *
* above is prohibited without the express written permission of Cypress.       *
*                                                                              *
* Disclaimer: THIS SOFTWARE IS PROVIDED AS-IS, WITH NO                         *
* WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING,                         *
* BUT NOT LIMITED TO, NONINFRINGEMENT, IMPLIED                                 *
* WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A                              *
* PARTICULAR PURPOSE. Cypress reserves the right to make                       *
* changes to the Software without notice. Cypress does not assume any          *
* liability arising out of the application or use of the Software or any       *
* product or circuit described in the Software. Cypress does not               *
* authorize its products for use in any products where a malfunction or        *
* failure of the Cypress product may reasonably be expected to result in       *
* significant property damage, injury or death ("High Risk Product"). By       *
* including Cypress's product in a High Risk Product, the manufacturer         *
* of such system or application assumes all risk of such use and in doing      *
* so agrees to indemnify Cypress against all liability.                        *
*******************************************************************************/
/**
 ******************************************************************************
 ** \file   s6e2g2xh.h
 **
 ** MCU Headerfile
 **
 ** History:
 
 **
 ******************************************************************************/

#ifndef _S6E2G2XH_H_
#define _S6E2G2XH_H_
#define __S6E2G2XH_H__
#define __S6E2G2_H__

#if defined __cplusplus
extern "C" {
#endif

#define FM_GENERAL_MCUHEADER_VERSION              0201


#ifndef FM_DEVICE_PACKAGE_S6E_H
#define FM_DEVICE_PACKAGE_S6E_H
#endif 

/******************************************************************************
 ** Configuration of the Cortex-M4 Processor and Core Peripherals
 ** 
 ******************************************************************************/
#define FM4_DEVICE_TYPE                           5
#define FM_DEVICE_TYPE                            4005u
#define FM_CORE_TYPE_FM4                          1
#define __CM4_REV                                 0x0001
#define __MPU_PRESENT                             1
#define __NVIC_PRIO_BITS                          4
#define __Vendor_SysTickConfig                    0
#define __FPU_PRESENT                             1
#define __FPU_DP                                  0
#define __ICACHE_PRESENT                          0
#define __DCACHE_PRESENT                          0
#define __DTCM_PRESENT                            0

/******************************************************************************
 ** Peripheral Types
 ** 
 ******************************************************************************/
#define FM4_ADC_TYPE_A                            1
#define FM4_BT_TYPE_A                             1
#define FM4_BTIOSEL03_TYPE_A                      1
#define FM4_BTIOSEL47_TYPE_A                      1
#define FM4_BTIOSEL8B_TYPE_A                      1
#define FM4_BTIOSELCF_TYPE_A                      1
#define FM4_CLK_GATING_TYPE_C                     1
#define FM4_CRC_TYPE_A                            1
#define FM4_CRG_TYPE_B                            1
#define FM4_CRTRIM_TYPE_A                         1
#define FM4_DMAC_TYPE_A                           1
#define FM4_DS_TYPE_A                             1
#define FM4_DSTC_TYPE_A                           1
#define FM4_DT_TYPE_A                             1
#define FM4_ECC_CAPTURE_TYPE_A                    1
#define FM4_ETHERNET_CONTROL_TYPE_A               1
#define FM4_ETHERNET_MAC_TYPE_A                   1
#define FM4_EXBUS_TYPE_B                          1
#define FM4_EXTI_TYPE_B                           1
#define FM4_FLASH_IF_TYPE_C                       1
#define FM4_GPIO_TYPE_D                           1
#define FM4_HWWDT_TYPE_A                          1
#define FM4_INTREQ_TYPE_B                         1
#define FM4_LSCRP_TYPE_A                          1
#define FM4_LVD_TYPE_A                            1
#define FM4_MFS_TYPE_B                            1
#define FM4_MFSI2S_TYPE_A                         1
#define FM4_MFT_TYPE_B                            1
#define FM4_MFT_PPG_TYPE_A                        1
#define FM4_QPRC_TYPE_B                           1
#define FM4_QPRC_NF_TYPE_A                        1
#define FM4_RTC_TYPE_C                            1
#define FM4_SBSSR_TYPE_A                          1
#define FM4_SMCIF_TYPE_A                          1
#define FM4_SWWDT_TYPE_A                          1
#define FM4_UNIQUE_ID_TYPE_A                      1
#define FM4_USB_TYPE_A                            1
#define FM4_USBETHERCLK_TYPE_A                    1
#define FM4_WC_TYPE_A                             1

