MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/S6E2G26H0AGV20000/mcu.h
typedef struct stc_ethernet_mac_mar21l_field
{
    union {
        struct {
            __IO  uint32_t  A                    :32;
        };
        struct {
            __IO  uint32_t  A0                   :1;
            __IO  uint32_t  A1                   :1;
            __IO  uint32_t  A2                   :1;
            __IO  uint32_t  A3                   :1;
            __IO  uint32_t  A4                   :1;
            __IO  uint32_t  A5                   :1;
            __IO  uint32_t  A6                   :1;
            __IO  uint32_t  A7                   :1;
            __IO  uint32_t  A8                   :1;
            __IO  uint32_t  A9                   :1;
            __IO  uint32_t  A10                  :1;
            __IO  uint32_t  A11                  :1;
            __IO  uint32_t  A12                  :1;
            __IO  uint32_t  A13                  :1;
            __IO  uint32_t  A14                  :1;
            __IO  uint32_t  A15                  :1;
            __IO  uint32_t  A16                  :1;
            __IO  uint32_t  A17                  :1;
            __IO  uint32_t  A18                  :1;
            __IO  uint32_t  A19                  :1;
            __IO  uint32_t  A20                  :1;
            __IO  uint32_t  A21                  :1;
            __IO  uint32_t  A22                  :1;
            __IO  uint32_t  A23                  :1;
            __IO  uint32_t  A24                  :1;
            __IO  uint32_t  A25                  :1;
            __IO  uint32_t  A26                  :1;
            __IO  uint32_t  A27                  :1;
            __IO  uint32_t  A28                  :1;
            __IO  uint32_t  A29                  :1;
            __IO  uint32_t  A30                  :1;
            __IO  uint32_t  A31                  :1;
        };
    };
} stc_ethernet_mac_mar21l_field_t;

typedef struct stc_ethernet_mac_mar22h_field
{
    union {
        struct {
            __IO  uint32_t  A                    :16;
            __IO  uint32_t  RESERVED0            :8;
            __IO  uint32_t  MBC                  :6;
            __IO  uint32_t  SA                   :1;
            __IO  uint32_t  AE                   :1;
        };
        struct {
            __IO  uint32_t  A0                   :1;
            __IO  uint32_t  A1                   :1;
            __IO  uint32_t  A2                   :1;
            __IO  uint32_t  A3                   :1;
            __IO  uint32_t  A4                   :1;
            __IO  uint32_t  A5                   :1;
            __IO  uint32_t  A6                   :1;
            __IO  uint32_t  A7                   :1;
            __IO  uint32_t  A8                   :1;
            __IO  uint32_t  A9                   :1;
            __IO  uint32_t  A10                  :1;
            __IO  uint32_t  A11                  :1;
            __IO  uint32_t  A12                  :1;
            __IO  uint32_t  A13                  :1;
            __IO  uint32_t  A14                  :1;
            __IO  uint32_t  A15                  :1;
            __IO  uint32_t  RESERVED1            :8;
            __IO  uint32_t  MBC0                 :1;
            __IO  uint32_t  MBC1                 :1;
            __IO  uint32_t  MBC2                 :1;
            __IO  uint32_t  MBC3                 :1;
            __IO  uint32_t  MBC4                 :1;
            __IO  uint32_t  MBC5                 :1;
            __IO  uint32_t  RESERVED2            :2;
        };
    };
} stc_ethernet_mac_mar22h_field_t;

typedef struct stc_ethernet_mac_mar22l_field
{
    union {
        struct {
            __IO  uint32_t  A                    :32;
        };
        struct {
            __IO  uint32_t  A0                   :1;
            __IO  uint32_t  A1                   :1;
            __IO  uint32_t  A2                   :1;
            __IO  uint32_t  A3                   :1;
            __IO  uint32_t  A4                   :1;
            __IO  uint32_t  A5                   :1;
            __IO  uint32_t  A6                   :1;
            __IO  uint32_t  A7                   :1;
            __IO  uint32_t  A8                   :1;
            __IO  uint32_t  A9                   :1;
            __IO  uint32_t  A10                  :1;
            __IO  uint32_t  A11                  :1;
            __IO  uint32_t  A12                  :1;
            __IO  uint32_t  A13                  :1;
            __IO  uint32_t  A14                  :1;
            __IO  uint32_t  A15                  :1;
            __IO  uint32_t  A16                  :1;
            __IO  uint32_t  A17                  :1;
            __IO  uint32_t  A18                  :1;
            __IO  uint32_t  A19                  :1;
            __IO  uint32_t  A20                  :1;
            __IO  uint32_t  A21                  :1;
            __IO  uint32_t  A22                  :1;
            __IO  uint32_t  A23                  :1;
            __IO  uint32_t  A24                  :1;
            __IO  uint32_t  A25                  :1;
            __IO  uint32_t  A26                  :1;
            __IO  uint32_t  A27                  :1;
            __IO  uint32_t  A28                  :1;
            __IO  uint32_t  A29                  :1;
            __IO  uint32_t  A30                  :1;
            __IO  uint32_t  A31                  :1;
        };
    };
} stc_ethernet_mac_mar22l_field_t;

typedef struct stc_ethernet_mac_mar23h_field
{
    union {
        struct {
            __IO  uint32_t  A                    :16;
            __IO  uint32_t  RESERVED0            :8;
            __IO  uint32_t  MBC                  :6;
            __IO  uint32_t  SA                   :1;
            __IO  uint32_t  AE                   :1;
        };
        struct {
            __IO  uint32_t  A0                   :1;
            __IO  uint32_t  A1                   :1;
            __IO  uint32_t  A2                   :1;
            __IO  uint32_t  A3                   :1;
            __IO  uint32_t  A4                   :1;
            __IO  uint32_t  A5                   :1;
            __IO  uint32_t  A6                   :1;
            __IO  uint32_t  A7                   :1;
            __IO  uint32_t  A8                   :1;
            __IO  uint32_t  A9                   :1;
            __IO  uint32_t  A10                  :1;
            __IO  uint32_t  A11                  :1;
            __IO  uint32_t  A12                  :1;
            __IO  uint32_t  A13                  :1;
            __IO  uint32_t  A14                  :1;
            __IO  uint32_t  A15                  :1;
            __IO  uint32_t  RESERVED1            :8;
            __IO  uint32_t  MBC0                 :1;
            __IO  uint32_t  MBC1                 :1;
            __IO  uint32_t  MBC2                 :1;
            __IO  uint32_t  MBC3                 :1;
            __IO  uint32_t  MBC4                 :1;
            __IO  uint32_t  MBC5                 :1;
            __IO  uint32_t  RESERVED2            :2;
        };
    };
} stc_ethernet_mac_mar23h_field_t;

typedef struct stc_ethernet_mac_mar23l_field
{
    union {
        struct {
            __IO  uint32_t  A                    :32;
        };
        struct {
            __IO  uint32_t  A0                   :1;
            __IO  uint32_t  A1                   :1;
            __IO  uint32_t  A2                   :1;
            __IO  uint32_t  A3                   :1;
            __IO  uint32_t  A4                   :1;
            __IO  uint32_t  A5                   :1;
            __IO  uint32_t  A6                   :1;
            __IO  uint32_t  A7                   :1;
            __IO  uint32_t  A8                   :1;
            __IO  uint32_t  A9                   :1;
            __IO  uint32_t  A10                  :1;
            __IO  uint32_t  A11                  :1;
            __IO  uint32_t  A12                  :1;
            __IO  uint32_t  A13                  :1;
            __IO  uint32_t  A14                  :1;
            __IO  uint32_t  A15                  :1;
            __IO  uint32_t  A16                  :1;
            __IO  uint32_t  A17                  :1;
            __IO  uint32_t  A18                  :1;
            __IO  uint32_t  A19                  :1;
            __IO  uint32_t  A20                  :1;
            __IO  uint32_t  A21                  :1;
            __IO  uint32_t  A22                  :1;
            __IO  uint32_t  A23                  :1;
            __IO  uint32_t  A24                  :1;
            __IO  uint32_t  A25                  :1;
            __IO  uint32_t  A26                  :1;
            __IO  uint32_t  A27                  :1;
            __IO  uint32_t  A28                  :1;
            __IO  uint32_t  A29                  :1;
            __IO  uint32_t  A30                  :1;
            __IO  uint32_t  A31                  :1;
        };
    };
} stc_ethernet_mac_mar23l_field_t;

typedef struct stc_ethernet_mac_mar24h_field
{
    union {
        struct {
            __IO  uint32_t  A                    :16;
            __IO  uint32_t  RESERVED0            :8;
            __IO  uint32_t  MBC                  :6;
            __IO  uint32_t  SA                   :1;
            __IO  uint32_t  AE                   :1;
        };
        struct {
            __IO  uint32_t  A0                   :1;
            __IO  uint32_t  A1                   :1;
            __IO  uint32_t  A2                   :1;
            __IO  uint32_t  A3                   :1;
            __IO  uint32_t  A4                   :1;
            __IO  uint32_t  A5                   :1;
            __IO  uint32_t  A6                   :1;
            __IO  uint32_t  A7                   :1;
            __IO  uint32_t  A8                   :1;
            __IO  uint32_t  A9                   :1;
            __IO  uint32_t  A10                  :1;
            __IO  uint32_t  A11                  :1;
            __IO  uint32_t  A12                  :1;
            __IO  uint32_t  A13                  :1;
            __IO  uint32_t  A14                  :1;
            __IO  uint32_t  A15                  :1;
            __IO  uint32_t  RESERVED1            :8;
            __IO  uint32_t  MBC0                 :1;
            __IO  uint32_t  MBC1                 :1;
            __IO  uint32_t  MBC2                 :1;
            __IO  uint32_t  MBC3                 :1;
            __IO  uint32_t  MBC4                 :1;
            __IO  uint32_t  MBC5                 :1;
            __IO  uint32_t  RESERVED2            :2;
        };
    };
} stc_ethernet_mac_mar24h_field_t;

