MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/S6E2G26H0AGV20000/mcu.h
              __IO uint8_t RX1024TOMAXOCTETS_GBHH;
            };
          };
        };
    };
    union {
        __IO uint32_t RXUNICASTFRAMES_G;
        struct {
          union {
            __IO uint16_t RXUNICASTFRAMES_GL;
            struct {
              __IO uint8_t RXUNICASTFRAMES_GLL;
              __IO uint8_t RXUNICASTFRAMES_GLH;
            };
          };
          union {
            __IO uint16_t RXUNICASTFRAMES_GH;
            struct {
              __IO uint8_t RXUNICASTFRAMES_GHL;
              __IO uint8_t RXUNICASTFRAMES_GHH;
            };
          };
        };
    };
    union {
        __IO uint32_t RXLENGTHERROR;
        struct {
          union {
            __IO uint16_t RXLENGTHERRORL;
            struct {
              __IO uint8_t RXLENGTHERRORLL;
              __IO uint8_t RXLENGTHERRORLH;
            };
          };
          union {
            __IO uint16_t RXLENGTHERRORH;
            struct {
              __IO uint8_t RXLENGTHERRORHL;
              __IO uint8_t RXLENGTHERRORHH;
            };
          };
        };
    };
    union {
        __IO uint32_t RXOUTOFRANGETYPE;
        struct {
          union {
            __IO uint16_t RXOUTOFRANGETYPEL;
            struct {
              __IO uint8_t RXOUTOFRANGETYPELL;
              __IO uint8_t RXOUTOFRANGETYPELH;
            };
          };
          union {
            __IO uint16_t RXOUTOFRANGETYPEH;
            struct {
              __IO uint8_t RXOUTOFRANGETYPEHL;
              __IO uint8_t RXOUTOFRANGETYPEHH;
            };
          };
        };
    };
    union {
        __IO uint32_t RXPAUSEFRAMES;
        struct {
          union {
            __IO uint16_t RXPAUSEFRAMESL;
            struct {
              __IO uint8_t RXPAUSEFRAMESLL;
              __IO uint8_t RXPAUSEFRAMESLH;
            };
          };
          union {
            __IO uint16_t RXPAUSEFRAMESH;
            struct {
              __IO uint8_t RXPAUSEFRAMESHL;
              __IO uint8_t RXPAUSEFRAMESHH;
            };
          };
        };
    };
    union {
        __IO uint32_t RXFIFOOVERFLOW;
        struct {
          union {
            __IO uint16_t RXFIFOOVERFLOWL;
            struct {
              __IO uint8_t RXFIFOOVERFLOWLL;
              __IO uint8_t RXFIFOOVERFLOWLH;
            };
          };
          union {
            __IO uint16_t RXFIFOOVERFLOWH;
            struct {
              __IO uint8_t RXFIFOOVERFLOWHL;
              __IO uint8_t RXFIFOOVERFLOWHH;
            };
          };
        };
    };
    union {
        __IO uint32_t RXVLANFRAMES_GB;
        struct {
          union {
            __IO uint16_t RXVLANFRAMES_GBL;
            struct {
              __IO uint8_t RXVLANFRAMES_GBLL;
              __IO uint8_t RXVLANFRAMES_GBLH;
            };
          };
          union {
            __IO uint16_t RXVLANFRAMES_GBH;
            struct {
              __IO uint8_t RXVLANFRAMES_GBHL;
              __IO uint8_t RXVLANFRAMES_GBHH;
            };
          };
        };
    };
    union {
        __IO uint32_t RXWATCHDOGERROR;
        struct {
          union {
            __IO uint16_t RXWATCHDOGERRORL;
            struct {
              __IO uint8_t RXWATCHDOGERRORLL;
              __IO uint8_t RXWATCHDOGERRORLH;
            };
          };
          union {
            __IO uint16_t RXWATCHDOGERRORH;
            struct {
              __IO uint8_t RXWATCHDOGERRORHL;
              __IO uint8_t RXWATCHDOGERRORHH;
            };
          };
        };
    };
        __IO  uint8_t RESERVED4[32];
    union {
        __IO uint32_t MMC_IPC_INTR_MASK_RX;
        stc_ethernet_mac_mmc_ipc_intr_mask_rx_field_t MMC_IPC_INTR_MASK_RX_f;
        struct {
          union {
            __IO uint16_t MMC_IPC_INTR_MASK_RXL;
            struct {
              __IO uint8_t MMC_IPC_INTR_MASK_RXLL;
              __IO uint8_t MMC_IPC_INTR_MASK_RXLH;
            };
          };
          union {
            __IO uint16_t MMC_IPC_INTR_MASK_RXH;
            struct {
              __IO uint8_t MMC_IPC_INTR_MASK_RXHL;
              __IO uint8_t MMC_IPC_INTR_MASK_RXHH;
            };
          };
        };
    };
        __IO  uint8_t RESERVED5[4];
    union {
        __IO uint32_t MMC_IPC_INTR_RX;
        stc_ethernet_mac_mmc_ipc_intr_rx_field_t MMC_IPC_INTR_RX_f;
        struct {
          union {
            __IO uint16_t MMC_IPC_INTR_RXL;
            struct {
              __IO uint8_t MMC_IPC_INTR_RXLL;
              __IO uint8_t MMC_IPC_INTR_RXLH;
            };
          };
          union {
            __IO uint16_t MMC_IPC_INTR_RXH;
            struct {
              __IO uint8_t MMC_IPC_INTR_RXHL;
              __IO uint8_t MMC_IPC_INTR_RXHH;
            };
          };
        };
    };
        __IO  uint8_t RESERVED6[4];
    union {
        __IO uint32_t RXIPV4_GD_FRMS;
        struct {
          union {
            __IO uint16_t RXIPV4_GD_FRMSL;
            struct {
              __IO uint8_t RXIPV4_GD_FRMSLL;
              __IO uint8_t RXIPV4_GD_FRMSLH;
            };
          };
          union {
            __IO uint16_t RXIPV4_GD_FRMSH;
            struct {
              __IO uint8_t RXIPV4_GD_FRMSHL;
              __IO uint8_t RXIPV4_GD_FRMSHH;
            };
          };
        };
    };
    union {
        __IO uint32_t RXIPV4_HDRERR_FRMS;
        struct {
          union {
            __IO uint16_t RXIPV4_HDRERR_FRMSL;
            struct {
              __IO uint8_t RXIPV4_HDRERR_FRMSLL;
              __IO uint8_t RXIPV4_HDRERR_FRMSLH;
            };
          };
          union {
            __IO uint16_t RXIPV4_HDRERR_FRMSH;
            struct {
              __IO uint8_t RXIPV4_HDRERR_FRMSHL;
              __IO uint8_t RXIPV4_HDRERR_FRMSHH;
            };
          };
        };
    };
    union {
        __IO uint32_t RXIPV4_NOPAY_FRMS;
        struct {
          union {
            __IO uint16_t RXIPV4_NOPAY_FRMSL;
            struct {
              __IO uint8_t RXIPV4_NOPAY_FRMSLL;
              __IO uint8_t RXIPV4_NOPAY_FRMSLH;
            };
          };
          union {
            __IO uint16_t RXIPV4_NOPAY_FRMSH;
            struct {
              __IO uint8_t RXIPV4_NOPAY_FRMSHL;
              __IO uint8_t RXIPV4_NOPAY_FRMSHH;
            };
          };
        };
    };
    union {
        __IO uint32_t RXIPV4_FRAG_FRMS;
        struct {
          union {
            __IO uint16_t RXIPV4_FRAG_FRMSL;
            struct {
              __IO uint8_t RXIPV4_FRAG_FRMSLL;
              __IO uint8_t RXIPV4_FRAG_FRMSLH;
            };
          };
          union {
            __IO uint16_t RXIPV4_FRAG_FRMSH;
            struct {
              __IO uint8_t RXIPV4_FRAG_FRMSHL;
              __IO uint8_t RXIPV4_FRAG_FRMSHH;
            };
          };
        };
    };
    union {
        __IO uint32_t RXIPV4_UDSBL_FRMS;
        struct {
          union {
            __IO uint16_t RXIPV4_UDSBL_FRMSL;
            struct {
              __IO uint8_t RXIPV4_UDSBL_FRMSLL;
              __IO uint8_t RXIPV4_UDSBL_FRMSLH;
            };
          };
          union {
            __IO uint16_t RXIPV4_UDSBL_FRMSH;
            struct {
              __IO uint8_t RXIPV4_UDSBL_FRMSHL;
              __IO uint8_t RXIPV4_UDSBL_FRMSHH;
            };
          };
        };
    };
    union {
        __IO uint32_t RXIPV6_GD_FRMS;
        struct {
          union {
            __IO uint16_t RXIPV6_GD_FRMSL;
            struct {
              __IO uint8_t RXIPV6_GD_FRMSLL;
              __IO uint8_t RXIPV6_GD_FRMSLH;
            };
          };
          union {
            __IO uint16_t RXIPV6_GD_FRMSH;
            struct {
              __IO uint8_t RXIPV6_GD_FRMSHL;
              __IO uint8_t RXIPV6_GD_FRMSHH;
            };
          };
        };
    };
    union {
        __IO uint32_t RXIPV6_HDRERR_FRMS;
        struct {
          union {
            __IO uint16_t RXIPV6_HDRERR_FRMSL;
            struct {
              __IO uint8_t RXIPV6_HDRERR_FRMSLL;
              __IO uint8_t RXIPV6_HDRERR_FRMSLH;
            };
          };
          union {
            __IO uint16_t RXIPV6_HDRERR_FRMSH;
            struct {
              __IO uint8_t RXIPV6_HDRERR_FRMSHL;
              __IO uint8_t RXIPV6_HDRERR_FRMSHH;
            };
          };
        };
    };
    union {
        __IO uint32_t RXIPV6_NOPAY_FRMS;
        struct {
          union {
            __IO uint16_t RXIPV6_NOPAY_FRMSL;
            struct {
              __IO uint8_t RXIPV6_NOPAY_FRMSLL;
              __IO uint8_t RXIPV6_NOPAY_FRMSLH;
            };
          };
          union {
            __IO uint16_t RXIPV6_NOPAY_FRMSH;
            struct {
              __IO uint8_t RXIPV6_NOPAY_FRMSHL;
              __IO uint8_t RXIPV6_NOPAY_FRMSHH;
            };
          };
        };
    };
    union {
        __IO uint32_t RXUDP_GD_FRMS;
        struct {
          union {
            __IO uint16_t RXUDP_GD_FRMSL;
            struct {
              __IO uint8_t RXUDP_GD_FRMSLL;
              __IO uint8_t RXUDP_GD_FRMSLH;
            };
          };
          union {
            __IO uint16_t RXUDP_GD_FRMSH;
            struct {
              __IO uint8_t RXUDP_GD_FRMSHL;
              __IO uint8_t RXUDP_GD_FRMSHH;
            };
          };
        };
    };
    union {
        __IO uint32_t RXUDP_ERR_FRMS;
        struct {
          union {
            __IO uint16_t RXUDP_ERR_FRMSL;
            struct {
              __IO uint8_t RXUDP_ERR_FRMSLL;
              __IO uint8_t RXUDP_ERR_FRMSLH;
            };
          };
          union {
            __IO uint16_t RXUDP_ERR_FRMSH;
            struct {
              __IO uint8_t RXUDP_ERR_FRMSHL;
              __IO uint8_t RXUDP_ERR_FRMSHH;
            };
          };
        };
    };
    union {
        __IO uint32_t RXTCP_GD_FRMS;
        struct {
          union {
            __IO uint16_t RXTCP_GD_FRMSL;
            struct {
              __IO uint8_t RXTCP_GD_FRMSLL;
              __IO uint8_t RXTCP_GD_FRMSLH;
            };
          };
          union {
            __IO uint16_t RXTCP_GD_FRMSH;
            struct {
              __IO uint8_t RXTCP_GD_FRMSHL;
              __IO uint8_t RXTCP_GD_FRMSHH;
            };
          };
        };
    };
    union {
        __IO uint32_t RXTCP_ERR_FRMS;
        struct {
          union {
            __IO uint16_t RXTCP_ERR_FRMSL;
            struct {
              __IO uint8_t RXTCP_ERR_FRMSLL;
              __IO uint8_t RXTCP_ERR_FRMSLH;
            };
          };
          union {
            __IO uint16_t RXTCP_ERR_FRMSH;
            struct {
              __IO uint8_t RXTCP_ERR_FRMSHL;
              __IO uint8_t RXTCP_ERR_FRMSHH;
            };
          };
        };
    };
    union {
        __IO uint32_t RXICMP_GD_FRMS;
        struct {
          union {
            __IO uint16_t RXICMP_GD_FRMSL;
            struct {
              __IO uint8_t RXICMP_GD_FRMSLL;
              __IO uint8_t RXICMP_GD_FRMSLH;
            };
          };
          union {
            __IO uint16_t RXICMP_GD_FRMSH;
            struct {
              __IO uint8_t RXICMP_GD_FRMSHL;
              __IO uint8_t RXICMP_GD_FRMSHH;
            };
          };
        };
    };
    union {
        __IO uint32_t RXICMP_ERR_FRMS;
        struct {
          union {
            __IO uint16_t RXICMP_ERR_FRMSL;
            struct {
              __IO uint8_t RXICMP_ERR_FRMSLL;
              __IO uint8_t RXICMP_ERR_FRMSLH;
            };
          };
          union {
            __IO uint16_t RXICMP_ERR_FRMSH;
            struct {
              __IO uint8_t RXICMP_ERR_FRMSHL;
              __IO uint8_t RXICMP_ERR_FRMSHH;
            };
          };
        };
    };
        __IO  uint8_t RESERVED7[8];
    union {
        __IO uint32_t RXIPV4_GD_OCTETS;
        struct {
          union {
            __IO uint16_t RXIPV4_GD_OCTETSL;
            struct {
              __IO uint8_t RXIPV4_GD_OCTETSLL;
              __IO uint8_t RXIPV4_GD_OCTETSLH;
            };
          };
          union {
            __IO uint16_t RXIPV4_GD_OCTETSH;
            struct {
              __IO uint8_t RXIPV4_GD_OCTETSHL;
              __IO uint8_t RXIPV4_GD_OCTETSHH;
            };
          };
        };
    };
    union {
        __IO uint32_t RXIPV4_HDRERR_OCTETS;
        struct {
          union {
            __IO uint16_t RXIPV4_HDRERR_OCTETSL;
            struct {
              __IO uint8_t RXIPV4_HDRERR_OCTETSLL;
              __IO uint8_t RXIPV4_HDRERR_OCTETSLH;
            };
          };
          union {
            __IO uint16_t RXIPV4_HDRERR_OCTETSH;
            struct {
              __IO uint8_t RXIPV4_HDRERR_OCTETSHL;
              __IO uint8_t RXIPV4_HDRERR_OCTETSHH;
            };
          };
        };
    };
    union {
        __IO uint32_t RXIPV4_NOPAY_OCTETS;
        struct {
          union {
            __IO uint16_t RXIPV4_NOPAY_OCTETSL;
            struct {
              __IO uint8_t RXIPV4_NOPAY_OCTETSLL;
              __IO uint8_t RXIPV4_NOPAY_OCTETSLH;
            };
          };
          union {
            __IO uint16_t RXIPV4_NOPAY_OCTETSH;
            struct {
              __IO uint8_t RXIPV4_NOPAY_OCTETSHL;
              __IO uint8_t RXIPV4_NOPAY_OCTETSHH;
            };
          };
        };
    };
    union {
        __IO uint32_t RXIPV4_FRAG_OCTETS;
        struct {
          union {
            __IO uint16_t RXIPV4_FRAG_OCTETSL;
            struct {
              __IO uint8_t RXIPV4_FRAG_OCTETSLL;
              __IO uint8_t RXIPV4_FRAG_OCTETSLH;
            };
          };
          union {
            __IO uint16_t RXIPV4_FRAG_OCTETSH;
            struct {
              __IO uint8_t RXIPV4_FRAG_OCTETSHL;
              __IO uint8_t RXIPV4_FRAG_OCTETSHH;
            };
          };
        };
    };
    union {
        __IO uint32_t RXIPV4_UDSBL_OCTETS;
        struct {
          union {
            __IO uint16_t RXIPV4_UDSBL_OCTETSL;
            struct {
              __IO uint8_t RXIPV4_UDSBL_OCTETSLL;
              __IO uint8_t RXIPV4_UDSBL_OCTETSLH;
            };
          };
          union {
            __IO uint16_t RXIPV4_UDSBL_OCTETSH;
            struct {
              __IO uint8_t RXIPV4_UDSBL_OCTETSHL;
              __IO uint8_t RXIPV4_UDSBL_OCTETSHH;
            };
          };
        };
    };
    union {
        __IO uint32_t RXIPV6_GD_OCTETS;
        struct {
          union {
            __IO uint16_t RXIPV6_GD_OCTETSL;
            struct {
              __IO uint8_t RXIPV6_GD_OCTETSLL;
              __IO uint8_t RXIPV6_GD_OCTETSLH;
            };
          };
          union {
            __IO uint16_t RXIPV6_GD_OCTETSH;
            struct {
              __IO uint8_t RXIPV6_GD_OCTETSHL;
              __IO uint8_t RXIPV6_GD_OCTETSHH;
            };
          };
        };
    };
    union {
        __IO uint32_t RXIPV6_HDRERR_OCTETS;
        struct {
          union {
            __IO uint16_t RXIPV6_HDRERR_OCTETSL;
            struct {
              __IO uint8_t RXIPV6_HDRERR_OCTETSLL;
              __IO uint8_t RXIPV6_HDRERR_OCTETSLH;
            };
          };
          union {
            __IO uint16_t RXIPV6_HDRERR_OCTETSH;
            struct {
              __IO uint8_t RXIPV6_HDRERR_OCTETSHL;
              __IO uint8_t RXIPV6_HDRERR_OCTETSHH;
            };
          };
        };
    };
    union {
        __IO uint32_t RXIPV6_NOPAY_OCTETS;
        struct {
          union {
            __IO uint16_t RXIPV6_NOPAY_OCTETSL;
            struct {
              __IO uint8_t RXIPV6_NOPAY_OCTETSLL;
              __IO uint8_t RXIPV6_NOPAY_OCTETSLH;
            };
          };
          union {
            __IO uint16_t RXIPV6_NOPAY_OCTETSH;
            struct {
              __IO uint8_t RXIPV6_NOPAY_OCTETSHL;
              __IO uint8_t RXIPV6_NOPAY_OCTETSHH;
            };
          };
        };
    };
    union {
        __IO uint32_t RXUDP_GD_OCTETS;
        struct {
          union {
            __IO uint16_t RXUDP_GD_OCTETSL;
            struct {
              __IO uint8_t RXUDP_GD_OCTETSLL;
              __IO uint8_t RXUDP_GD_OCTETSLH;
            };
          };
          union {
            __IO uint16_t RXUDP_GD_OCTETSH;
            struct {
              __IO uint8_t RXUDP_GD_OCTETSHL;
              __IO uint8_t RXUDP_GD_OCTETSHH;
            };
          };
        };
    };
    union {
        __IO uint32_t RXUDP_ERR_OCTETS;
        struct {
          union {
            __IO uint16_t RXUDP_ERR_OCTETSL;
            struct {
              __IO uint8_t RXUDP_ERR_OCTETSLL;
              __IO uint8_t RXUDP_ERR_OCTETSLH;
            };
          };
          union {
            __IO uint16_t RXUDP_ERR_OCTETSH;
            struct {
              __IO uint8_t RXUDP_ERR_OCTETSHL;
              __IO uint8_t RXUDP_ERR_OCTETSHH;
            };
          };
        };
    };
    union {
        __IO uint32_t RXTCP_GD_OCTETS;
        struct {
          union {
            __IO uint16_t RXTCP_GD_OCTETSL;
            struct {
              __IO uint8_t RXTCP_GD_OCTETSLL;
              __IO uint8_t RXTCP_GD_OCTETSLH;
            };
          };
          union {
            __IO uint16_t RXTCP_GD_OCTETSH;
            struct {
              __IO uint8_t RXTCP_GD_OCTETSHL;
              __IO uint8_t RXTCP_GD_OCTETSHH;
            };
          };
        };
    };
    union {
        __IO uint32_t RXTCP_ERR_OCTETS;
        struct {
          union {
            __IO uint16_t RXTCP_ERR_OCTETSL;
            struct {
              __IO uint8_t RXTCP_ERR_OCTETSLL;
              __IO uint8_t RXTCP_ERR_OCTETSLH;
            };
          };
          union {
            __IO uint16_t RXTCP_ERR_OCTETSH;
            struct {
              __IO uint8_t RXTCP_ERR_OCTETSHL;
              __IO uint8_t RXTCP_ERR_OCTETSHH;
            };
          };
        };
    };
    union {
        __IO uint32_t RXICMP_GD_OCTETS;
        struct {
          union {
            __IO uint16_t RXICMP_GD_OCTETSL;
            struct {
              __IO uint8_t RXICMP_GD_OCTETSLL;
              __IO uint8_t RXICMP_GD_OCTETSLH;
            };
          };
          union {
            __IO uint16_t RXICMP_GD_OCTETSH;
            struct {
              __IO uint8_t RXICMP_GD_OCTETSHL;
              __IO uint8_t RXICMP_GD_OCTETSHH;
            };
          };
        };
    };
    union {
        __IO uint32_t RXICMP_ERR_OCTETS;
        struct {
          union {
            __IO uint16_t RXICMP_ERR_OCTETSL;
            struct {
              __IO uint8_t RXICMP_ERR_OCTETSLL;
              __IO uint8_t RXICMP_ERR_OCTETSLH;
            };
          };
          union {
            __IO uint16_t RXICMP_ERR_OCTETSH;
            struct {
              __IO uint8_t RXICMP_ERR_OCTETSHL;
              __IO uint8_t RXICMP_ERR_OCTETSHH;
            };
          };
        };
    };
        __IO  uint8_t RESERVED8[1144];
    union {
        __IO uint32_t TSCR;
        stc_ethernet_mac_tscr_field_t TSCR_f;
        struct {
          union {
            __IO uint16_t TSCRL;
            struct {
              __IO uint8_t TSCRLL;
              __IO uint8_t TSCRLH;
            };
          };
          union {
            __IO uint16_t TSCRH;
            struct {
              __IO uint8_t TSCRHL;
              __IO uint8_t TSCRHH;
            };
          };
        };
    };
    union {
        __IO uint32_t SSIR;
        stc_ethernet_mac_ssir_field_t SSIR_f;
        struct {
          union {
            __IO uint16_t SSIRL;
            struct {
              __IO uint8_t SSIRLL;
              __IO uint8_t SSIRLH;
            };
          };
          union {
            __IO uint16_t SSIRH;
            struct {
              __IO uint8_t SSIRHL;
              __IO uint8_t SSIRHH;
            };
          };
        };
    };
    union {
        __IO uint32_t STSR;
        stc_ethernet_mac_stsr_field_t STSR_f;
        struct {
          union {
            __IO uint16_t STSRL;
            struct {
              __IO uint8_t STSRLL;
              __IO uint8_t STSRLH;
            };
          };
          union {
            __IO uint16_t STSRH;
            struct {
              __IO uint8_t STSRHL;
              __IO uint8_t STSRHH;
            };
          };
        };
    };
    union {
        __IO uint32_t STNR;
        stc_ethernet_mac_stnr_field_t STNR_f;
        struct {
          union {
            __IO uint16_t STNRL;
            struct {
              __IO uint8_t STNRLL;
              __IO uint8_t STNRLH;
            };
          };
          union {
            __IO uint16_t STNRH;
            struct {
              __IO uint8_t STNRHL;
              __IO uint8_t STNRHH;
            };
          };
        };
    };
    union {
        __IO uint32_t STSUR;
        stc_ethernet_mac_stsur_field_t STSUR_f;
        struct {
          union {
            __IO uint16_t STSURL;
            struct {
              __IO uint8_t STSURLL;
              __IO uint8_t STSURLH;
            };
          };
          union {
            __IO uint16_t STSURH;
            struct {
              __IO uint8_t STSURHL;
              __IO uint8_t STSURHH;
            };
          };
        };
    };
    union {
        __IO uint32_t STNUR;
        stc_ethernet_mac_stnur_field_t STNUR_f;
        struct {
          union {
            __IO uint16_t STNURL;
            struct {
              __IO uint8_t STNURLL;
              __IO uint8_t STNURLH;
            };
          };
          union {
            __IO uint16_t STNURH;
            struct {
              __IO uint8_t STNURHL;
              __IO uint8_t STNURHH;
            };
          };
        };
    };
    union {
        __IO uint32_t TSAR;
        stc_ethernet_mac_tsar_field_t TSAR_f;
        struct {
          union {
            __IO uint16_t TSARL;
            struct {
              __IO uint8_t TSARLL;
              __IO uint8_t TSARLH;
            };
          };
          union {
            __IO uint16_t TSARH;
            struct {
              __IO uint8_t TSARHL;
              __IO uint8_t TSARHH;
            };
          };
        };
    };
    union {
        __IO uint32_t TTSR;
        stc_ethernet_mac_ttsr_field_t TTSR_f;
        struct {
          union {
            __IO uint16_t TTSRL;
            struct {
              __IO uint8_t TTSRLL;
              __IO uint8_t TTSRLH;
            };
          };
          union {
            __IO uint16_t TTSRH;
            struct {
              __IO uint8_t TTSRHL;
              __IO uint8_t TTSRHH;
            };
          };
        };
    };
    union {
        __IO uint32_t TTNR;
        stc_ethernet_mac_ttnr_field_t TTNR_f;
        struct {
          union {
            __IO uint16_t TTNRL;
            struct {
              __IO uint8_t TTNRLL;
              __IO uint8_t TTNRLH;
            };
          };
          union {
            __IO uint16_t TTNRH;
            struct {
              __IO uint8_t TTNRHL;
              __IO uint8_t TTNRHH;
            };
          };
        };
    };
    union {
        __IO uint32_t STHWSR;
        stc_ethernet_mac_sthwsr_field_t STHWSR_f;
        struct {
          union {
            __IO uint16_t STHWSRL;
            struct {
              __IO uint8_t STHWSRLL;
              __IO uint8_t STHWSRLH;
            };
          };
          union {
            __IO uint16_t STHWSRH;
            struct {
              __IO uint8_t STHWSRHL;
              __IO uint8_t STHWSRHH;
            };
          };
        };
    };
    union {
        __IO uint32_t TSR;
        stc_ethernet_mac_tsr_field_t TSR_f;
        struct {
          union {
            __IO uint16_t TSRL;
            struct {
              __IO uint8_t TSRLL;
              __IO uint8_t TSRLH;
            };
          };
          union {
            __IO uint16_t TSRH;
            struct {
              __IO uint8_t TSRHL;
              __IO uint8_t TSRHH;
            };
          };
        };
