MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/S6E2G26H0AGV20000/mcu.h
/******************************************************************************
 ** BT Registers BT9
 ** 
 **   Register Definition
 ******************************************************************************/
#define FM_BT9_PPG_PRLL                           *((volatile uint16_t*)(0x40025440UL))
#define FM4_BT9_PPG_PRLL                          *((volatile uint16_t*)(0x40025440UL))
#define FM_BT9_PWM_PCSR                           *((volatile uint16_t*)(0x40025440UL))
#define FM4_BT9_PWM_PCSR                          *((volatile uint16_t*)(0x40025440UL))
#define FM_BT9_RT_PCSR                            *((volatile uint16_t*)(0x40025440UL))
#define FM4_BT9_RT_PCSR                           *((volatile uint16_t*)(0x40025440UL))
#define FM_BT9_PPG_PRLH                           *((volatile uint16_t*)(0x40025444UL))
#define FM4_BT9_PPG_PRLH                          *((volatile uint16_t*)(0x40025444UL))
#define FM_BT9_PWC_DTBF                           *((volatile uint16_t*)(0x40025444UL))
#define FM4_BT9_PWC_DTBF                          *((volatile uint16_t*)(0x40025444UL))
#define FM_BT9_PWM_PDUT                           *((volatile uint16_t*)(0x40025444UL))
#define FM4_BT9_PWM_PDUT                          *((volatile uint16_t*)(0x40025444UL))
#define FM_BT9_PPG_TMR                            *((volatile uint16_t*)(0x40025448UL))
#define FM4_BT9_PPG_TMR                           *((volatile uint16_t*)(0x40025448UL))
#define FM_BT9_PWM_TMR                            *((volatile uint16_t*)(0x40025448UL))
#define FM4_BT9_PWM_TMR                           *((volatile uint16_t*)(0x40025448UL))
#define FM_BT9_RT_TMR                             *((volatile uint16_t*)(0x40025448UL))
#define FM4_BT9_RT_TMR                            *((volatile uint16_t*)(0x40025448UL))
#define FM_BT9_PPG_TMCR                           *((volatile uint16_t*)(0x4002544CUL))
#define FM4_BT9_PPG_TMCR                          *((volatile uint16_t*)(0x4002544CUL))
#define FM_BT9_PWC_TMCR                           *((volatile uint16_t*)(0x4002544CUL))
#define FM4_BT9_PWC_TMCR                          *((volatile uint16_t*)(0x4002544CUL))
#define FM_BT9_PWM_TMCR                           *((volatile uint16_t*)(0x4002544CUL))
#define FM4_BT9_PWM_TMCR                          *((volatile uint16_t*)(0x4002544CUL))
#define FM_BT9_RT_TMCR                            *((volatile uint16_t*)(0x4002544CUL))
#define FM4_BT9_RT_TMCR                           *((volatile uint16_t*)(0x4002544CUL))
#define FM_BT9_PPG_STC                            *((volatile  uint8_t*)(0x40025450UL))
#define FM4_BT9_PPG_STC                           *((volatile  uint8_t*)(0x40025450UL))
#define FM_BT9_PWC_STC                            *((volatile  uint8_t*)(0x40025450UL))
#define FM4_BT9_PWC_STC                           *((volatile  uint8_t*)(0x40025450UL))
#define FM_BT9_PWM_STC                            *((volatile  uint8_t*)(0x40025450UL))
#define FM4_BT9_PWM_STC                           *((volatile  uint8_t*)(0x40025450UL))
#define FM_BT9_RT_STC                             *((volatile  uint8_t*)(0x40025450UL))
#define FM4_BT9_RT_STC                            *((volatile  uint8_t*)(0x40025450UL))
#define FM_BT9_PPG_TMCR2                          *((volatile  uint8_t*)(0x40025451UL))
#define FM4_BT9_PPG_TMCR2                         *((volatile  uint8_t*)(0x40025451UL))
#define FM_BT9_PWC_TMCR2                          *((volatile  uint8_t*)(0x40025451UL))
#define FM4_BT9_PWC_TMCR2                         *((volatile  uint8_t*)(0x40025451UL))
#define FM_BT9_PWM_TMCR2                          *((volatile  uint8_t*)(0x40025451UL))
#define FM4_BT9_PWM_TMCR2                         *((volatile  uint8_t*)(0x40025451UL))
#define FM_BT9_RT_TMCR2                           *((volatile  uint8_t*)(0x40025451UL))
#define FM4_BT9_RT_TMCR2                          *((volatile  uint8_t*)(0x40025451UL))

/******************************************************************************
 ** BTIOSEL03 Registers BTIOSEL03
 ** 
 **   Register Definition
 ******************************************************************************/
#define FM_BTIOSEL03_BTSEL0123                    *((volatile  uint8_t*)(0x40025101UL))
#define FM4_BTIOSEL03_BTSEL0123                   *((volatile  uint8_t*)(0x40025101UL))

/******************************************************************************
 ** BTIOSEL47 Registers BTIOSEL47
 ** 
 **   Register Definition
 ******************************************************************************/
#define FM_BTIOSEL47_BTSEL4567                    *((volatile  uint8_t*)(0x40025301UL))
#define FM4_BTIOSEL47_BTSEL4567                   *((volatile  uint8_t*)(0x40025301UL))

/******************************************************************************
 ** BTIOSEL8B Registers BTIOSEL8B
 ** 
 **   Register Definition
 ******************************************************************************/
#define FM_BTIOSEL8B_BTSEL89AB                    *((volatile  uint8_t*)(0x40025501UL))
#define FM4_BTIOSEL8B_BTSEL89AB                   *((volatile  uint8_t*)(0x40025501UL))

/******************************************************************************
 ** BTIOSELCF Registers BTIOSELCF
 ** 
 **   Register Definition
 ******************************************************************************/
#define FM_BTIOSELCF_BTSELCDEF                    *((volatile  uint8_t*)(0x40025701UL))
#define FM4_BTIOSELCF_BTSELCDEF                   *((volatile  uint8_t*)(0x40025701UL))

/******************************************************************************
 ** CLK_GATING Registers CLK_GATING
 ** 
 **   Register Definition
 ******************************************************************************/
#define FM_CLK_GATING_CKEN0                       *((volatile uint32_t*)(0x4003C100UL))
#define FM4_CLK_GATING_CKEN0                      *((volatile uint32_t*)(0x4003C100UL))
#define FM_CLK_GATING_MRST0                       *((volatile uint32_t*)(0x4003C104UL))
#define FM4_CLK_GATING_MRST0                      *((volatile uint32_t*)(0x4003C104UL))
#define FM_CLK_GATING_CKEN1                       *((volatile uint32_t*)(0x4003C110UL))
#define FM4_CLK_GATING_CKEN1                      *((volatile uint32_t*)(0x4003C110UL))
#define FM_CLK_GATING_MRST1                       *((volatile uint32_t*)(0x4003C114UL))
#define FM4_CLK_GATING_MRST1                      *((volatile uint32_t*)(0x4003C114UL))
#define FM_CLK_GATING_CKEN2                       *((volatile uint32_t*)(0x4003C120UL))
#define FM4_CLK_GATING_CKEN2                      *((volatile uint32_t*)(0x4003C120UL))
#define FM_CLK_GATING_MRST2                       *((volatile uint32_t*)(0x4003C124UL))
#define FM4_CLK_GATING_MRST2                      *((volatile uint32_t*)(0x4003C124UL))

