MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/S6E2G26H0AGV20000/mcu.h
#define FM4_GPIO_PZR1                             *((volatile uint32_t*)(0x4006F704UL))
#define FM_GPIO_PZR2                              *((volatile uint32_t*)(0x4006F708UL))
#define FM4_GPIO_PZR2                             *((volatile uint32_t*)(0x4006F708UL))
#define FM_GPIO_PZR3                              *((volatile uint32_t*)(0x4006F70CUL))
#define FM4_GPIO_PZR3                             *((volatile uint32_t*)(0x4006F70CUL))
#define FM_GPIO_PZR4                              *((volatile uint32_t*)(0x4006F710UL))
#define FM4_GPIO_PZR4                             *((volatile uint32_t*)(0x4006F710UL))
#define FM_GPIO_PZR5                              *((volatile uint32_t*)(0x4006F714UL))
#define FM4_GPIO_PZR5                             *((volatile uint32_t*)(0x4006F714UL))
#define FM_GPIO_PZR6                              *((volatile uint32_t*)(0x4006F718UL))
#define FM4_GPIO_PZR6                             *((volatile uint32_t*)(0x4006F718UL))
#define FM_GPIO_PZR7                              *((volatile uint32_t*)(0x4006F71CUL))
#define FM4_GPIO_PZR7                             *((volatile uint32_t*)(0x4006F71CUL))
#define FM_GPIO_PZR8                              *((volatile uint32_t*)(0x4006F720UL))
#define FM4_GPIO_PZR8                             *((volatile uint32_t*)(0x4006F720UL))
#define FM_GPIO_PZR9                              *((volatile uint32_t*)(0x4006F724UL))
#define FM4_GPIO_PZR9                             *((volatile uint32_t*)(0x4006F724UL))
#define FM_GPIO_PZRA                              *((volatile uint32_t*)(0x4006F728UL))
#define FM4_GPIO_PZRA                             *((volatile uint32_t*)(0x4006F728UL))
#define FM_GPIO_PZRB                              *((volatile uint32_t*)(0x4006F72CUL))
#define FM4_GPIO_PZRB                             *((volatile uint32_t*)(0x4006F72CUL))
#define FM_GPIO_PZRC                              *((volatile uint32_t*)(0x4006F730UL))
#define FM4_GPIO_PZRC                             *((volatile uint32_t*)(0x4006F730UL))
#define FM_GPIO_PZRD                              *((volatile uint32_t*)(0x4006F734UL))
#define FM4_GPIO_PZRD                             *((volatile uint32_t*)(0x4006F734UL))
#define FM_GPIO_PZRE                              *((volatile uint32_t*)(0x4006F738UL))
#define FM4_GPIO_PZRE                             *((volatile uint32_t*)(0x4006F738UL))
#define FM_GPIO_PZRF                              *((volatile uint32_t*)(0x4006F73CUL))
#define FM4_GPIO_PZRF                             *((volatile uint32_t*)(0x4006F73CUL))
#define FM_GPIO_PDSR0                             *((volatile uint32_t*)(0x4006F740UL))
#define FM4_GPIO_PDSR0                            *((volatile uint32_t*)(0x4006F740UL))
#define FM_GPIO_PDSR1                             *((volatile uint32_t*)(0x4006F744UL))
#define FM4_GPIO_PDSR1                            *((volatile uint32_t*)(0x4006F744UL))
#define FM_GPIO_PDSR2                             *((volatile uint32_t*)(0x4006F748UL))
#define FM4_GPIO_PDSR2                            *((volatile uint32_t*)(0x4006F748UL))
#define FM_GPIO_PDSR3                             *((volatile uint32_t*)(0x4006F74CUL))
#define FM4_GPIO_PDSR3                            *((volatile uint32_t*)(0x4006F74CUL))
#define FM_GPIO_PDSR4                             *((volatile uint32_t*)(0x4006F750UL))
#define FM4_GPIO_PDSR4                            *((volatile uint32_t*)(0x4006F750UL))
#define FM_GPIO_PDSR5                             *((volatile uint32_t*)(0x4006F754UL))
#define FM4_GPIO_PDSR5                            *((volatile uint32_t*)(0x4006F754UL))
#define FM_GPIO_PDSR6                             *((volatile uint32_t*)(0x4006F758UL))
#define FM4_GPIO_PDSR6                            *((volatile uint32_t*)(0x4006F758UL))
#define FM_GPIO_PDSR7                             *((volatile uint32_t*)(0x4006F75CUL))
#define FM4_GPIO_PDSR7                            *((volatile uint32_t*)(0x4006F75CUL))
#define FM_GPIO_PDSR8                             *((volatile uint32_t*)(0x4006F760UL))
#define FM4_GPIO_PDSR8                            *((volatile uint32_t*)(0x4006F760UL))
#define FM_GPIO_PDSR9                             *((volatile uint32_t*)(0x4006F764UL))
#define FM4_GPIO_PDSR9                            *((volatile uint32_t*)(0x4006F764UL))
#define FM_GPIO_PDSRA                             *((volatile uint32_t*)(0x4006F768UL))
#define FM4_GPIO_PDSRA                            *((volatile uint32_t*)(0x4006F768UL))
#define FM_GPIO_PDSRB                             *((volatile uint32_t*)(0x4006F76CUL))
#define FM4_GPIO_PDSRB                            *((volatile uint32_t*)(0x4006F76CUL))
#define FM_GPIO_PDSRC                             *((volatile uint32_t*)(0x4006F770UL))
#define FM4_GPIO_PDSRC                            *((volatile uint32_t*)(0x4006F770UL))
#define FM_GPIO_PDSRD                             *((volatile uint32_t*)(0x4006F774UL))
#define FM4_GPIO_PDSRD                            *((volatile uint32_t*)(0x4006F774UL))
#define FM_GPIO_PDSRE                             *((volatile uint32_t*)(0x4006F778UL))
#define FM4_GPIO_PDSRE                            *((volatile uint32_t*)(0x4006F778UL))
#define FM_GPIO_PDSRF                             *((volatile uint32_t*)(0x4006F77CUL))
#define FM4_GPIO_PDSRF                            *((volatile uint32_t*)(0x4006F77CUL))

/******************************************************************************
 ** HWWDT Registers HWWDT
 ** 
 **   Register Definition
 ******************************************************************************/
#define FM_HWWDT_WDG_LDR                          *((volatile uint32_t*)(0x40011000UL))
#define FM4_HWWDT_WDG_LDR                         *((volatile uint32_t*)(0x40011000UL))
#define FM_HWWDT_WDG_VLR                          *((volatile uint32_t*)(0x40011004UL))
#define FM4_HWWDT_WDG_VLR                         *((volatile uint32_t*)(0x40011004UL))
#define FM_HWWDT_WDG_CTL                          *((volatile uint32_t*)(0x40011008UL))
#define FM4_HWWDT_WDG_CTL                         *((volatile uint32_t*)(0x40011008UL))
#define FM_HWWDT_WDG_ICL                          *((volatile uint32_t*)(0x4001100CUL))
#define FM4_HWWDT_WDG_ICL                         *((volatile uint32_t*)(0x4001100CUL))
#define FM_HWWDT_WDG_RIS                          *((volatile uint32_t*)(0x40011010UL))
#define FM4_HWWDT_WDG_RIS                         *((volatile uint32_t*)(0x40011010UL))
#define FM_HWWDT_WDG_LCK                          *((volatile uint32_t*)(0x40011C00UL))
#define FM4_HWWDT_WDG_LCK                         *((volatile uint32_t*)(0x40011C00UL))

