MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/S6E2G26H0AGV20000/mcu.h
/******************************************************************************
 ** QPRC Registers QPRC0
 ** 
 **   Register Definition
 ******************************************************************************/
#define FM_QPRC0_QPCR                             *((volatile uint16_t*)(0x40026000UL))
#define FM4_QPRC0_QPCR                            *((volatile uint16_t*)(0x40026000UL))
#define FM_QPRC0_QRCR                             *((volatile uint16_t*)(0x40026004UL))
#define FM4_QPRC0_QRCR                            *((volatile uint16_t*)(0x40026004UL))
#define FM_QPRC0_QPCCR                            *((volatile uint16_t*)(0x40026008UL))
#define FM4_QPRC0_QPCCR                           *((volatile uint16_t*)(0x40026008UL))
#define FM_QPRC0_QPRCR                            *((volatile uint16_t*)(0x4002600CUL))
#define FM4_QPRC0_QPRCR                           *((volatile uint16_t*)(0x4002600CUL))
#define FM_QPRC0_QMPR                             *((volatile uint16_t*)(0x40026010UL))
#define FM4_QPRC0_QMPR                            *((volatile uint16_t*)(0x40026010UL))
#define FM_QPRC0_QICRL                            *((volatile  uint8_t*)(0x40026014UL))
#define FM4_QPRC0_QICRL                           *((volatile  uint8_t*)(0x40026014UL))
#define FM_QPRC0_QICRH                            *((volatile  uint8_t*)(0x40026015UL))
#define FM4_QPRC0_QICRH                           *((volatile  uint8_t*)(0x40026015UL))
#define FM_QPRC0_QCR                              *((volatile uint16_t*)(0x40026018UL))
#define FM4_QPRC0_QCR                             *((volatile uint16_t*)(0x40026018UL))
#define FM_QPRC0_QECR                             *((volatile uint16_t*)(0x4002601CUL))
#define FM4_QPRC0_QECR                            *((volatile uint16_t*)(0x4002601CUL))
#define FM_QPRC0_QPRCRR                           *((volatile uint32_t*)(0x4002603CUL))
#define FM4_QPRC0_QPRCRR                          *((volatile uint32_t*)(0x4002603CUL))

/******************************************************************************
 ** QPRC_NF Registers QPRC0_NF
 ** 
 **   Register Definition
 ******************************************************************************/
#define FM_QPRC0_NF_NFCTLA                        *((volatile  uint8_t*)(0x40026100UL))
#define FM4_QPRC0_NF_NFCTLA                       *((volatile  uint8_t*)(0x40026100UL))
#define FM_QPRC0_NF_NFCTLB                        *((volatile  uint8_t*)(0x40026104UL))
#define FM4_QPRC0_NF_NFCTLB                       *((volatile  uint8_t*)(0x40026104UL))
#define FM_QPRC0_NF_NFCTLZ                        *((volatile  uint8_t*)(0x40026108UL))
#define FM4_QPRC0_NF_NFCTLZ                       *((volatile  uint8_t*)(0x40026108UL))

/******************************************************************************
 ** QPRC Registers QPRC1
 ** 
 **   Register Definition
 ******************************************************************************/
#define FM_QPRC1_QPCR                             *((volatile uint16_t*)(0x40026040UL))
#define FM4_QPRC1_QPCR                            *((volatile uint16_t*)(0x40026040UL))
#define FM_QPRC1_QRCR                             *((volatile uint16_t*)(0x40026044UL))
#define FM4_QPRC1_QRCR                            *((volatile uint16_t*)(0x40026044UL))
#define FM_QPRC1_QPCCR                            *((volatile uint16_t*)(0x40026048UL))
#define FM4_QPRC1_QPCCR                           *((volatile uint16_t*)(0x40026048UL))
#define FM_QPRC1_QPRCR                            *((volatile uint16_t*)(0x4002604CUL))
#define FM4_QPRC1_QPRCR                           *((volatile uint16_t*)(0x4002604CUL))
#define FM_QPRC1_QMPR                             *((volatile uint16_t*)(0x40026050UL))
#define FM4_QPRC1_QMPR                            *((volatile uint16_t*)(0x40026050UL))
#define FM_QPRC1_QICRL                            *((volatile  uint8_t*)(0x40026054UL))
#define FM4_QPRC1_QICRL                           *((volatile  uint8_t*)(0x40026054UL))
#define FM_QPRC1_QICRH                            *((volatile  uint8_t*)(0x40026055UL))
#define FM4_QPRC1_QICRH                           *((volatile  uint8_t*)(0x40026055UL))
#define FM_QPRC1_QCR                              *((volatile uint16_t*)(0x40026058UL))
#define FM4_QPRC1_QCR                             *((volatile uint16_t*)(0x40026058UL))
#define FM_QPRC1_QECR                             *((volatile uint16_t*)(0x4002605CUL))
#define FM4_QPRC1_QECR                            *((volatile uint16_t*)(0x4002605CUL))
#define FM_QPRC1_QPRCRR                           *((volatile uint32_t*)(0x4002607CUL))
#define FM4_QPRC1_QPRCRR                          *((volatile uint32_t*)(0x4002607CUL))

/******************************************************************************
 ** QPRC_NF Registers QPRC1_NF
 ** 
 **   Register Definition
 ******************************************************************************/
#define FM_QPRC1_NF_NFCTLA                        *((volatile  uint8_t*)(0x40026110UL))
#define FM4_QPRC1_NF_NFCTLA                       *((volatile  uint8_t*)(0x40026110UL))
#define FM_QPRC1_NF_NFCTLB                        *((volatile  uint8_t*)(0x40026114UL))
#define FM4_QPRC1_NF_NFCTLB                       *((volatile  uint8_t*)(0x40026114UL))
#define FM_QPRC1_NF_NFCTLZ                        *((volatile  uint8_t*)(0x40026118UL))
#define FM4_QPRC1_NF_NFCTLZ                       *((volatile  uint8_t*)(0x40026118UL))

/******************************************************************************
 ** QPRC Registers QPRC2
 ** 
 **   Register Definition
 ******************************************************************************/
#define FM_QPRC2_QPCR                             *((volatile uint16_t*)(0x40026080UL))
#define FM4_QPRC2_QPCR                            *((volatile uint16_t*)(0x40026080UL))
#define FM_QPRC2_QRCR                             *((volatile uint16_t*)(0x40026084UL))
#define FM4_QPRC2_QRCR                            *((volatile uint16_t*)(0x40026084UL))
#define FM_QPRC2_QPCCR                            *((volatile uint16_t*)(0x40026088UL))
#define FM4_QPRC2_QPCCR                           *((volatile uint16_t*)(0x40026088UL))
#define FM_QPRC2_QPRCR                            *((volatile uint16_t*)(0x4002608CUL))
#define FM4_QPRC2_QPRCR                           *((volatile uint16_t*)(0x4002608CUL))
#define FM_QPRC2_QMPR                             *((volatile uint16_t*)(0x40026090UL))
#define FM4_QPRC2_QMPR                            *((volatile uint16_t*)(0x40026090UL))
#define FM_QPRC2_QICRL                            *((volatile  uint8_t*)(0x40026094UL))
#define FM4_QPRC2_QICRL                           *((volatile  uint8_t*)(0x40026094UL))
#define FM_QPRC2_QICRH                            *((volatile  uint8_t*)(0x40026095UL))
#define FM4_QPRC2_QICRH                           *((volatile  uint8_t*)(0x40026095UL))
#define FM_QPRC2_QCR                              *((volatile uint16_t*)(0x40026098UL))
#define FM4_QPRC2_QCR                             *((volatile uint16_t*)(0x40026098UL))
#define FM_QPRC2_QECR                             *((volatile uint16_t*)(0x4002609CUL))
#define FM4_QPRC2_QECR                            *((volatile uint16_t*)(0x4002609CUL))
#define FM_QPRC2_QPRCRR                           *((volatile uint32_t*)(0x400260BCUL))
#define FM4_QPRC2_QPRCRR                          *((volatile uint32_t*)(0x400260BCUL))

