MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/S6E2G26H0AGV20000/mcu.h
#define bFM_BT14_RT_TMCR2_CKS3                    *((volatile  uint8_t *)(0x424AD220UL))
#define bFM4_BT14_RT_TMCR2_CKS3                   *((volatile  uint8_t *)(0x424AD220UL))
#define bFM_BT14_RT_TMCR2_GATE                    *((volatile  uint8_t *)(0x424AD23CUL))
#define bFM4_BT14_RT_TMCR2_GATE                   *((volatile  uint8_t *)(0x424AD23CUL))


/******************************************************************************
 ** BT Registers BT15
 ** 
 **   Bitband Section
 ******************************************************************************/
#define bFM_BT15_PPG_STC_UDIR                     *((volatile  uint8_t *)(0x424ADA00UL))
#define bFM4_BT15_PPG_STC_UDIR                    *((volatile  uint8_t *)(0x424ADA00UL))
#define bFM_BT15_PPG_STC_TGIR                     *((volatile  uint8_t *)(0x424ADA08UL))
#define bFM4_BT15_PPG_STC_TGIR                    *((volatile  uint8_t *)(0x424ADA08UL))
#define bFM_BT15_PPG_STC_UDIE                     *((volatile  uint8_t *)(0x424ADA10UL))
#define bFM4_BT15_PPG_STC_UDIE                    *((volatile  uint8_t *)(0x424ADA10UL))
#define bFM_BT15_PPG_STC_TGIE                     *((volatile  uint8_t *)(0x424ADA18UL))
#define bFM4_BT15_PPG_STC_TGIE                    *((volatile  uint8_t *)(0x424ADA18UL))

#define bFM_BT15_PPG_TMCR_STRG                    *((volatile  uint8_t *)(0x424AD980UL))
#define bFM4_BT15_PPG_TMCR_STRG                   *((volatile  uint8_t *)(0x424AD980UL))
#define bFM_BT15_PPG_TMCR_CTEN                    *((volatile  uint8_t *)(0x424AD984UL))
#define bFM4_BT15_PPG_TMCR_CTEN                   *((volatile  uint8_t *)(0x424AD984UL))
#define bFM_BT15_PPG_TMCR_MDSE                    *((volatile  uint8_t *)(0x424AD988UL))
#define bFM4_BT15_PPG_TMCR_MDSE                   *((volatile  uint8_t *)(0x424AD988UL))
#define bFM_BT15_PPG_TMCR_OSEL                    *((volatile  uint8_t *)(0x424AD98CUL))
#define bFM4_BT15_PPG_TMCR_OSEL                   *((volatile  uint8_t *)(0x424AD98CUL))
#define bFM_BT15_PPG_TMCR_PMSK                    *((volatile  uint8_t *)(0x424AD9A8UL))
#define bFM4_BT15_PPG_TMCR_PMSK                   *((volatile  uint8_t *)(0x424AD9A8UL))
#define bFM_BT15_PPG_TMCR_RTGEN                   *((volatile  uint8_t *)(0x424AD9ACUL))
#define bFM4_BT15_PPG_TMCR_RTGEN                  *((volatile  uint8_t *)(0x424AD9ACUL))

#define bFM_BT15_PPG_TMCR2_CKS3                   *((volatile  uint8_t *)(0x424ADA20UL))
#define bFM4_BT15_PPG_TMCR2_CKS3                  *((volatile  uint8_t *)(0x424ADA20UL))

#define bFM_BT15_PWC_STC_OVIR                     *((volatile  uint8_t *)(0x424ADA00UL))
#define bFM4_BT15_PWC_STC_OVIR                    *((volatile  uint8_t *)(0x424ADA00UL))
#define bFM_BT15_PWC_STC_EDIR                     *((volatile  uint8_t *)(0x424ADA08UL))
#define bFM4_BT15_PWC_STC_EDIR                    *((volatile  uint8_t *)(0x424ADA08UL))
#define bFM_BT15_PWC_STC_OVIE                     *((volatile  uint8_t *)(0x424ADA10UL))
#define bFM4_BT15_PWC_STC_OVIE                    *((volatile  uint8_t *)(0x424ADA10UL))
#define bFM_BT15_PWC_STC_EDIE                     *((volatile  uint8_t *)(0x424ADA18UL))
#define bFM4_BT15_PWC_STC_EDIE                    *((volatile  uint8_t *)(0x424ADA18UL))
#define bFM_BT15_PWC_STC_ERR                      *((volatile  uint8_t *)(0x424ADA1CUL))
#define bFM4_BT15_PWC_STC_ERR                     *((volatile  uint8_t *)(0x424ADA1CUL))

#define bFM_BT15_PWC_TMCR_CTEN                    *((volatile  uint8_t *)(0x424AD984UL))
#define bFM4_BT15_PWC_TMCR_CTEN                   *((volatile  uint8_t *)(0x424AD984UL))
#define bFM_BT15_PWC_TMCR_MDSE                    *((volatile  uint8_t *)(0x424AD988UL))
#define bFM4_BT15_PWC_TMCR_MDSE                   *((volatile  uint8_t *)(0x424AD988UL))
#define bFM_BT15_PWC_TMCR_T32                     *((volatile  uint8_t *)(0x424AD99CUL))
#define bFM4_BT15_PWC_TMCR_T32                    *((volatile  uint8_t *)(0x424AD99CUL))

#define bFM_BT15_PWC_TMCR2_CKS3                   *((volatile  uint8_t *)(0x424ADA20UL))
#define bFM4_BT15_PWC_TMCR2_CKS3                  *((volatile  uint8_t *)(0x424ADA20UL))

#define bFM_BT15_PWM_STC_UDIR                     *((volatile  uint8_t *)(0x424ADA00UL))
#define bFM4_BT15_PWM_STC_UDIR                    *((volatile  uint8_t *)(0x424ADA00UL))
#define bFM_BT15_PWM_STC_DTIR                     *((volatile  uint8_t *)(0x424ADA04UL))
#define bFM4_BT15_PWM_STC_DTIR                    *((volatile  uint8_t *)(0x424ADA04UL))
#define bFM_BT15_PWM_STC_TGIR                     *((volatile  uint8_t *)(0x424ADA08UL))
#define bFM4_BT15_PWM_STC_TGIR                    *((volatile  uint8_t *)(0x424ADA08UL))
#define bFM_BT15_PWM_STC_UDIE                     *((volatile  uint8_t *)(0x424ADA10UL))
#define bFM4_BT15_PWM_STC_UDIE                    *((volatile  uint8_t *)(0x424ADA10UL))
#define bFM_BT15_PWM_STC_DTIE                     *((volatile  uint8_t *)(0x424ADA14UL))
#define bFM4_BT15_PWM_STC_DTIE                    *((volatile  uint8_t *)(0x424ADA14UL))
#define bFM_BT15_PWM_STC_TGIE                     *((volatile  uint8_t *)(0x424ADA18UL))
#define bFM4_BT15_PWM_STC_TGIE                    *((volatile  uint8_t *)(0x424ADA18UL))

#define bFM_BT15_PWM_TMCR_STRG                    *((volatile  uint8_t *)(0x424AD980UL))
#define bFM4_BT15_PWM_TMCR_STRG                   *((volatile  uint8_t *)(0x424AD980UL))
#define bFM_BT15_PWM_TMCR_CTEN                    *((volatile  uint8_t *)(0x424AD984UL))
#define bFM4_BT15_PWM_TMCR_CTEN                   *((volatile  uint8_t *)(0x424AD984UL))
#define bFM_BT15_PWM_TMCR_MDSE                    *((volatile  uint8_t *)(0x424AD988UL))
#define bFM4_BT15_PWM_TMCR_MDSE                   *((volatile  uint8_t *)(0x424AD988UL))
#define bFM_BT15_PWM_TMCR_OSEL                    *((volatile  uint8_t *)(0x424AD98CUL))
#define bFM4_BT15_PWM_TMCR_OSEL                   *((volatile  uint8_t *)(0x424AD98CUL))
#define bFM_BT15_PWM_TMCR_PMSK                    *((volatile  uint8_t *)(0x424AD9A8UL))
#define bFM4_BT15_PWM_TMCR_PMSK                   *((volatile  uint8_t *)(0x424AD9A8UL))
#define bFM_BT15_PWM_TMCR_RTGEN                   *((volatile  uint8_t *)(0x424AD9ACUL))
#define bFM4_BT15_PWM_TMCR_RTGEN                  *((volatile  uint8_t *)(0x424AD9ACUL))

#define bFM_BT15_PWM_TMCR2_CKS3                   *((volatile  uint8_t *)(0x424ADA20UL))
#define bFM4_BT15_PWM_TMCR2_CKS3                  *((volatile  uint8_t *)(0x424ADA20UL))

#define bFM_BT15_RT_STC_UDIR                      *((volatile  uint8_t *)(0x424ADA00UL))
#define bFM4_BT15_RT_STC_UDIR                     *((volatile  uint8_t *)(0x424ADA00UL))
#define bFM_BT15_RT_STC_TGIR                      *((volatile  uint8_t *)(0x424ADA08UL))
#define bFM4_BT15_RT_STC_TGIR                     *((volatile  uint8_t *)(0x424ADA08UL))
#define bFM_BT15_RT_STC_UDIE                      *((volatile  uint8_t *)(0x424ADA10UL))
#define bFM4_BT15_RT_STC_UDIE                     *((volatile  uint8_t *)(0x424ADA10UL))
#define bFM_BT15_RT_STC_TGIE                      *((volatile  uint8_t *)(0x424ADA18UL))
#define bFM4_BT15_RT_STC_TGIE                     *((volatile  uint8_t *)(0x424ADA18UL))

#define bFM_BT15_RT_TMCR_STRG                     *((volatile  uint8_t *)(0x424AD980UL))
#define bFM4_BT15_RT_TMCR_STRG                    *((volatile  uint8_t *)(0x424AD980UL))
#define bFM_BT15_RT_TMCR_CTEN                     *((volatile  uint8_t *)(0x424AD984UL))
#define bFM4_BT15_RT_TMCR_CTEN                    *((volatile  uint8_t *)(0x424AD984UL))
#define bFM_BT15_RT_TMCR_MDSE                     *((volatile  uint8_t *)(0x424AD988UL))
#define bFM4_BT15_RT_TMCR_MDSE                    *((volatile  uint8_t *)(0x424AD988UL))
#define bFM_BT15_RT_TMCR_OSEL                     *((volatile  uint8_t *)(0x424AD98CUL))
#define bFM4_BT15_RT_TMCR_OSEL                    *((volatile  uint8_t *)(0x424AD98CUL))
#define bFM_BT15_RT_TMCR_T32                      *((volatile  uint8_t *)(0x424AD99CUL))
#define bFM4_BT15_RT_TMCR_T32                     *((volatile  uint8_t *)(0x424AD99CUL))

