MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/S6E2G26H0AGV20000/mcu.h
#define bFM_MFT0_OCU_OCSA32_CST2                  *((volatile  uint8_t *)(0x42402380UL))
#define bFM4_MFT0_OCU_OCSA32_CST2                 *((volatile  uint8_t *)(0x42402380UL))
#define bFM_MFT0_OCU_OCSA32_CST3                  *((volatile  uint8_t *)(0x42402384UL))
#define bFM4_MFT0_OCU_OCSA32_CST3                 *((volatile  uint8_t *)(0x42402384UL))
#define bFM_MFT0_OCU_OCSA32_IOE2                  *((volatile  uint8_t *)(0x42402390UL))
#define bFM4_MFT0_OCU_OCSA32_IOE2                 *((volatile  uint8_t *)(0x42402390UL))
#define bFM_MFT0_OCU_OCSA32_IOE3                  *((volatile  uint8_t *)(0x42402394UL))
#define bFM4_MFT0_OCU_OCSA32_IOE3                 *((volatile  uint8_t *)(0x42402394UL))
#define bFM_MFT0_OCU_OCSA32_IOP2                  *((volatile  uint8_t *)(0x42402398UL))
#define bFM4_MFT0_OCU_OCSA32_IOP2                 *((volatile  uint8_t *)(0x42402398UL))
#define bFM_MFT0_OCU_OCSA32_IOP3                  *((volatile  uint8_t *)(0x4240239CUL))
#define bFM4_MFT0_OCU_OCSA32_IOP3                 *((volatile  uint8_t *)(0x4240239CUL))

#define bFM_MFT0_OCU_OCSA54_CST4                  *((volatile  uint8_t *)(0x42402400UL))
#define bFM4_MFT0_OCU_OCSA54_CST4                 *((volatile  uint8_t *)(0x42402400UL))
#define bFM_MFT0_OCU_OCSA54_CST5                  *((volatile  uint8_t *)(0x42402404UL))
#define bFM4_MFT0_OCU_OCSA54_CST5                 *((volatile  uint8_t *)(0x42402404UL))
#define bFM_MFT0_OCU_OCSA54_IOE4                  *((volatile  uint8_t *)(0x42402410UL))
#define bFM4_MFT0_OCU_OCSA54_IOE4                 *((volatile  uint8_t *)(0x42402410UL))
#define bFM_MFT0_OCU_OCSA54_IOE5                  *((volatile  uint8_t *)(0x42402414UL))
#define bFM4_MFT0_OCU_OCSA54_IOE5                 *((volatile  uint8_t *)(0x42402414UL))
#define bFM_MFT0_OCU_OCSA54_IOP4                  *((volatile  uint8_t *)(0x42402418UL))
#define bFM4_MFT0_OCU_OCSA54_IOP4                 *((volatile  uint8_t *)(0x42402418UL))
#define bFM_MFT0_OCU_OCSA54_IOP5                  *((volatile  uint8_t *)(0x4240241CUL))
#define bFM4_MFT0_OCU_OCSA54_IOP5                 *((volatile  uint8_t *)(0x4240241CUL))

#define bFM_MFT0_OCU_OCSB10_OTD0                  *((volatile  uint8_t *)(0x42402320UL))
#define bFM4_MFT0_OCU_OCSB10_OTD0                 *((volatile  uint8_t *)(0x42402320UL))
#define bFM_MFT0_OCU_OCSB10_OTD1                  *((volatile  uint8_t *)(0x42402324UL))
#define bFM4_MFT0_OCU_OCSB10_OTD1                 *((volatile  uint8_t *)(0x42402324UL))
#define bFM_MFT0_OCU_OCSB10_CMOD                  *((volatile  uint8_t *)(0x42402330UL))
#define bFM4_MFT0_OCU_OCSB10_CMOD                 *((volatile  uint8_t *)(0x42402330UL))
#define bFM_MFT0_OCU_OCSB10_FM4                   *((volatile  uint8_t *)(0x4240233CUL))
#define bFM4_MFT0_OCU_OCSB10_FM4                  *((volatile  uint8_t *)(0x4240233CUL))

#define bFM_MFT0_OCU_OCSB32_OTD2                  *((volatile  uint8_t *)(0x424023A0UL))
#define bFM4_MFT0_OCU_OCSB32_OTD2                 *((volatile  uint8_t *)(0x424023A0UL))
#define bFM_MFT0_OCU_OCSB32_OTD3                  *((volatile  uint8_t *)(0x424023A4UL))
#define bFM4_MFT0_OCU_OCSB32_OTD3                 *((volatile  uint8_t *)(0x424023A4UL))
#define bFM_MFT0_OCU_OCSB32_CMOD                  *((volatile  uint8_t *)(0x424023B0UL))
#define bFM4_MFT0_OCU_OCSB32_CMOD                 *((volatile  uint8_t *)(0x424023B0UL))
#define bFM_MFT0_OCU_OCSB32_FM4                   *((volatile  uint8_t *)(0x424023BCUL))
#define bFM4_MFT0_OCU_OCSB32_FM4                  *((volatile  uint8_t *)(0x424023BCUL))

#define bFM_MFT0_OCU_OCSB54_OTD4                  *((volatile  uint8_t *)(0x42402420UL))
#define bFM4_MFT0_OCU_OCSB54_OTD4                 *((volatile  uint8_t *)(0x42402420UL))
#define bFM_MFT0_OCU_OCSB54_OTD5                  *((volatile  uint8_t *)(0x42402424UL))
#define bFM4_MFT0_OCU_OCSB54_OTD5                 *((volatile  uint8_t *)(0x42402424UL))
#define bFM_MFT0_OCU_OCSB54_CMOD                  *((volatile  uint8_t *)(0x42402430UL))
#define bFM4_MFT0_OCU_OCSB54_CMOD                 *((volatile  uint8_t *)(0x42402430UL))
#define bFM_MFT0_OCU_OCSB54_FM4                   *((volatile  uint8_t *)(0x4240243CUL))
#define bFM4_MFT0_OCU_OCSB54_FM4                  *((volatile  uint8_t *)(0x4240243CUL))

#define bFM_MFT0_OCU_OCSC_MOD0                    *((volatile  uint8_t *)(0x424024A0UL))
#define bFM4_MFT0_OCU_OCSC_MOD0                   *((volatile  uint8_t *)(0x424024A0UL))
#define bFM_MFT0_OCU_OCSC_MOD1                    *((volatile  uint8_t *)(0x424024A4UL))
#define bFM4_MFT0_OCU_OCSC_MOD1                   *((volatile  uint8_t *)(0x424024A4UL))
#define bFM_MFT0_OCU_OCSC_MOD2                    *((volatile  uint8_t *)(0x424024A8UL))
#define bFM4_MFT0_OCU_OCSC_MOD2                   *((volatile  uint8_t *)(0x424024A8UL))
#define bFM_MFT0_OCU_OCSC_MOD3                    *((volatile  uint8_t *)(0x424024ACUL))
#define bFM4_MFT0_OCU_OCSC_MOD3                   *((volatile  uint8_t *)(0x424024ACUL))
#define bFM_MFT0_OCU_OCSC_MOD4                    *((volatile  uint8_t *)(0x424024B0UL))
#define bFM4_MFT0_OCU_OCSC_MOD4                   *((volatile  uint8_t *)(0x424024B0UL))
#define bFM_MFT0_OCU_OCSC_MOD5                    *((volatile  uint8_t *)(0x424024B4UL))
#define bFM4_MFT0_OCU_OCSC_MOD5                   *((volatile  uint8_t *)(0x424024B4UL))

#define bFM_MFT0_OCU_OCSD10_OPBM0                 *((volatile  uint8_t *)(0x42402360UL))
#define bFM4_MFT0_OCU_OCSD10_OPBM0                *((volatile  uint8_t *)(0x42402360UL))
#define bFM_MFT0_OCU_OCSD10_OPBM1                 *((volatile  uint8_t *)(0x42402364UL))
#define bFM4_MFT0_OCU_OCSD10_OPBM1                *((volatile  uint8_t *)(0x42402364UL))
#define bFM_MFT0_OCU_OCSD10_OEBM0                 *((volatile  uint8_t *)(0x42402368UL))
#define bFM4_MFT0_OCU_OCSD10_OEBM0                *((volatile  uint8_t *)(0x42402368UL))
#define bFM_MFT0_OCU_OCSD10_OEBM1                 *((volatile  uint8_t *)(0x4240236CUL))
#define bFM4_MFT0_OCU_OCSD10_OEBM1                *((volatile  uint8_t *)(0x4240236CUL))
#define bFM_MFT0_OCU_OCSD10_OFEX0                 *((volatile  uint8_t *)(0x42402370UL))
#define bFM4_MFT0_OCU_OCSD10_OFEX0                *((volatile  uint8_t *)(0x42402370UL))
#define bFM_MFT0_OCU_OCSD10_OFEX1                 *((volatile  uint8_t *)(0x42402374UL))
#define bFM4_MFT0_OCU_OCSD10_OFEX1                *((volatile  uint8_t *)(0x42402374UL))

#define bFM_MFT0_OCU_OCSD32_OPBM2                 *((volatile  uint8_t *)(0x424023E0UL))
#define bFM4_MFT0_OCU_OCSD32_OPBM2                *((volatile  uint8_t *)(0x424023E0UL))
#define bFM_MFT0_OCU_OCSD32_OPBM3                 *((volatile  uint8_t *)(0x424023E4UL))
#define bFM4_MFT0_OCU_OCSD32_OPBM3                *((volatile  uint8_t *)(0x424023E4UL))
#define bFM_MFT0_OCU_OCSD32_OEBM2                 *((volatile  uint8_t *)(0x424023E8UL))
#define bFM4_MFT0_OCU_OCSD32_OEBM2                *((volatile  uint8_t *)(0x424023E8UL))
#define bFM_MFT0_OCU_OCSD32_OEBM3                 *((volatile  uint8_t *)(0x424023ECUL))
#define bFM4_MFT0_OCU_OCSD32_OEBM3                *((volatile  uint8_t *)(0x424023ECUL))
#define bFM_MFT0_OCU_OCSD32_OFEX2                 *((volatile  uint8_t *)(0x424023F0UL))
#define bFM4_MFT0_OCU_OCSD32_OFEX2                *((volatile  uint8_t *)(0x424023F0UL))
#define bFM_MFT0_OCU_OCSD32_OFEX3                 *((volatile  uint8_t *)(0x424023F4UL))
#define bFM4_MFT0_OCU_OCSD32_OFEX3                *((volatile  uint8_t *)(0x424023F4UL))

#define bFM_MFT0_OCU_OCSD54_OPBM4                 *((volatile  uint8_t *)(0x42402460UL))
#define bFM4_MFT0_OCU_OCSD54_OPBM4                *((volatile  uint8_t *)(0x42402460UL))
#define bFM_MFT0_OCU_OCSD54_OPBM5                 *((volatile  uint8_t *)(0x42402464UL))
#define bFM4_MFT0_OCU_OCSD54_OPBM5                *((volatile  uint8_t *)(0x42402464UL))
#define bFM_MFT0_OCU_OCSD54_OEBM4                 *((volatile  uint8_t *)(0x42402468UL))
#define bFM4_MFT0_OCU_OCSD54_OEBM4                *((volatile  uint8_t *)(0x42402468UL))
#define bFM_MFT0_OCU_OCSD54_OEBM5                 *((volatile  uint8_t *)(0x4240246CUL))
#define bFM4_MFT0_OCU_OCSD54_OEBM5                *((volatile  uint8_t *)(0x4240246CUL))
#define bFM_MFT0_OCU_OCSD54_OFEX4                 *((volatile  uint8_t *)(0x42402470UL))
#define bFM4_MFT0_OCU_OCSD54_OFEX4                *((volatile  uint8_t *)(0x42402470UL))
#define bFM_MFT0_OCU_OCSD54_OFEX5                 *((volatile  uint8_t *)(0x42402474UL))
#define bFM4_MFT0_OCU_OCSD54_OFEX5                *((volatile  uint8_t *)(0x42402474UL))

